In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry', 'rohan', 'skillf', 'shubh'],
    "mark":[93, 34, 24,17],
    "city":['dhaka', 'khulna', 'kushtia', 'kolkata'],
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  mark     city
0   harry    93    dhaka
1   rohan    34   khulna
2  skillf    24  kushtia
3   shubh    17  kolkata

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

    name  mark    city
0  harry    93   dhaka
1  rohan    34  khulna

In [8]:
df.tail(2)

     name  mark     city
2  skillf    24  kushtia
3   shubh    17  kolkata

In [9]:
df.describe()

            mark
count   4.000000
mean   42.000000
std    34.708308
min    17.000000
25%    22.250000
50%    29.000000
75%    48.750000
max    93.000000

In [10]:
shah = pd.read_csv('shah.csv')

In [11]:
shah

   Unnamed: 0.1  Unnamed: 0    name  mark     city
0             0           0   harry    99    dhaka
1             1           1   rohan    34   khulna
2             2           2  skillf    24  kushtia
3             3           3   shubh    17  kolkata

In [12]:
shah['city']

0      dhaka
1     khulna
2    kushtia
3    kolkata
Name: city, dtype: object

In [13]:
shah['mark'][0]

99

In [14]:
shah['mark'][0] = 99

C:\Users\Shah\AppData\Local\Temp\ipykernel_12776\2909341055.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  shah['mark'][0] = 99
C:\Users\Shah\AppData\Local\Temp\ipykernel_12776\2909341055.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  shah['mark'][0] = 99

In [15]:
shah

   Unnamed: 0.1  Unnamed: 0    name  mark     city
0             0           0   harry    99    dhaka
1             1           1   rohan    34   khulna
2             2           2  skillf    24  kushtia
3             3           3   shubh    17  kolkata

In [16]:
shah.to_csv('shah.csv')

In [17]:
shah.index = ['1st', '2nd', '3rd', '4th']

In [18]:
shah

     Unnamed: 0.1  Unnamed: 0    name  mark     city
1st             0           0   harry    99    dhaka
2nd             1           1   rohan    34   khulna
3rd             2           2  skillf    24  kushtia
4th             3           3   shubh    17  kolkata

In [19]:
print("shazid")

shazid

In [22]:
ser = pd.Series(np.random.rand(34))

In [24]:
type(ser)

pandas.core.series.Series

In [25]:
newdf= pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [32]:
type(newdf)
newdf.head()

          0         1         2         3         4
0  0.982308  0.283467  0.558325  0.099521  0.580030
1  0.758037  0.819420  0.084669  0.956381  0.762292
2  0.045291  0.670764  0.995318  0.810501  0.432487
3  0.775309  0.447354  0.277670  0.799304  0.752667
4  0.406862  0.580318  0.516866  0.925759  0.404664

In [30]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.472086    0.477036    0.484826    0.514729    0.498421
std      0.286235    0.295580    0.291457    0.297916    0.293207
min      0.000649    0.003174    0.000233    0.000531    0.000267
25%      0.231194    0.221135    0.243900    0.252407    0.237193
50%      0.465986    0.452543    0.474677    0.554424    0.499734
75%      0.701253    0.725445    0.734483    0.761267    0.747929
max      0.997682    0.998913    0.998764    0.999733    0.997650

In [31]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [33]:
new[0][0] = "shah"

C:\Users\Shah\AppData\Local\Temp\ipykernel_12776\3669502842.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "shah"
C:\Users\Shah\AppData\Local\Temp\ipykernel_12776\3669502842.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'shah' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "shah"

In [35]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [36]:
newdf.head()

          0         1         2         3         4
0      shah  0.283467  0.558325  0.099521  0.580030
1  0.758037  0.819420  0.084669  0.956381  0.762292
2  0.045291  0.670764  0.995318  0.810501  0.432487
3  0.775309  0.447354  0.277670  0.799304  0.752667
4  0.406862  0.580318  0.516866  0.925759  0.404664

In [37]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [39]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [43]:
newdf.to_numpy()

array([[0.5, 0.2834670455555838, 0.558325149426977, 0.09952147340967388,
        0.5800296249405198],
       [0.7580365519219289, 0.8194201890973482, 0.08466872618746046,
        0.9563811822794697, 0.7622915109014915],
       [0.045291104472533705, 0.6707636683384393, 0.9953177780037582,
        0.8105013031725551, 0.43248732903133813],
       ...,
       [0.22613551513832397, 0.01841123422097135, 0.6705039432222472,
        0.4947461928396527, 0.33061597854585],
       [0.20854318603517574, 0.08057702238235764, 0.1710177824667023,
        0.7509010684402381, 0.9419170305720507],
       [0.557432433591376, 0.1422113978803461, 0.270363983220096,
        0.07075185138718543, 0.8520544963201458]], dtype=object)

In [41]:
newdf[0][0] = 0.5

In [42]:
newdf.head()

          0         1         2         3         4
0       0.5  0.283467  0.558325  0.099521  0.580030
1  0.758037  0.819420  0.084669  0.956381  0.762292
2  0.045291  0.670764  0.995318  0.810501  0.432487
3  0.775309  0.447354  0.277670  0.799304  0.752667
4  0.406862  0.580318  0.516866  0.925759  0.404664

In [44]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.5,0.758037,0.045291,0.775309,0.406862,0.883702,0.177297,0.320164,0.001111,0.865264,...,0.171172,0.648261,0.591477,0.427773,0.293981,0.660409,0.217587,0.226136,0.208543,0.557432
1,0.283467,0.81942,0.670764,0.447354,0.580318,0.564304,0.874482,0.761728,0.292914,0.197245,...,0.336937,0.18304,0.472969,0.802031,0.930177,0.4131,0.674201,0.018411,0.080577,0.142211
2,0.558325,0.084669,0.995318,0.27767,0.516866,0.551848,0.565028,0.756568,0.328437,0.983371,...,0.503186,0.656747,0.081019,0.738827,0.682216,0.245654,0.72944,0.670504,0.171018,0.270364
3,0.099521,0.956381,0.810501,0.799304,0.925759,0.358962,0.295315,0.679912,0.482612,0.513827,...,0.676744,0.348518,0.467115,0.701941,0.241116,0.782361,0.825213,0.494746,0.750901,0.070752
4,0.58003,0.762292,0.432487,0.752667,0.404664,0.375629,0.306449,0.451921,0.31483,0.043389,...,0.027918,0.085681,0.443153,0.130911,0.722072,0.293122,0.18329,0.330616,0.941917,0.852054

In [46]:
newdf.head()

          0         1         2         3         4
0       0.5  0.283467  0.558325  0.099521  0.580030
1  0.758037  0.819420  0.084669  0.956381  0.762292
2  0.045291  0.670764  0.995318  0.810501  0.432487
3  0.775309  0.447354  0.277670  0.799304  0.752667
4  0.406862  0.580318  0.516866  0.925759  0.404664

In [48]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.580030  0.099521  0.558325  0.283467       0.5
1    0.762292  0.956381  0.084669  0.819420  0.758037
2    0.432487  0.810501  0.995318  0.670764  0.045291
3    0.752667  0.799304  0.277670  0.447354  0.775309
4    0.404664  0.925759  0.516866  0.580318  0.406862
..        ...       ...       ...       ...       ...
329  0.293122  0.782361  0.245654  0.413100  0.660409
330  0.183290  0.825213  0.729440  0.674201  0.217587
331  0.330616  0.494746  0.670504  0.018411  0.226136
332  0.941917  0.750901  0.171018  0.080577  0.208543
333  0.852054  0.070752  0.270364  0.142211  0.557432

[334 rows x 5 columns]

In [49]:
newdf.head()

          0         1         2         3         4
0       0.5  0.283467  0.558325  0.099521  0.580030
1  0.758037  0.819420  0.084669  0.956381  0.762292
2  0.045291  0.670764  0.995318  0.810501  0.432487
3  0.775309  0.447354  0.277670  0.799304  0.752667
4  0.406862  0.580318  0.516866  0.925759  0.404664

In [51]:
type(newdf[0])

pandas.core.series.Series

In [56]:
newdf2 =newdf.copy()

In [57]:
newdf2[0][0] = 9785

C:\Users\Shah\AppData\Local\Temp\ipykernel_12776\570901836.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][0] = 9785
C:\Users\Shah\AppData\Local\Temp\ipykernel_12776\570901836.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 9785

In [58]:
newdf

            0         1         2         3         4
0        9784  0.283467  0.558325  0.099521  0.580030
1    0.758037  0.819420  0.084669  0.956381  0.762292
2    0.045291  0.670764  0.995318  0.810501  0.432487
3    0.775309  0.447354  0.277670  0.799304  0.752667
4    0.406862  0.580318  0.516866  0.925759  0.404664
..        ...       ...       ...       ...       ...
329  0.660409  0.413100  0.245654  0.782361  0.293122
330  0.217587  0.674201  0.729440  0.825213  0.183290
331  0.226136  0.018411  0.670504  0.494746  0.330616
332  0.208543  0.080577  0.171018  0.750901  0.941917
333  0.557432  0.142211  0.270364  0.070752  0.852054

[334 rows x 5 columns]